#乱数の作成

import numpy as np

#乱数の一次元配列
np.random.rand() #0.411747917200765 乱数の値は実行毎に変化する
np.random.rand(3) #array([0.35461122, 0.85450071, 0.38256295]) サイズが3つの乱数

#乱数の多次元配列
np.random.rand(3,3) #array([[0.91946745, 0.4332486 , 0.45984222],
                            #[0.31814348, 0.53786299, 0.1821217 ],
                            #[0.44277759, 0.63777588, 0.07485491]])

#整数での乱数の作成
np.random.randint(1,10) #3 1-10までの間で整数の乱数を作成

np.random.randint(1,10(5,)) #array([2, 5, 1, 9, 2]) サイズが5の一次元配列を作成
np.random.randint(1,10(2,5))#array([[3, 7, 1, 7, 5],
                                    #[4, 2, 8, 6, 1]])サイズが5で行数が2の多次元配列
